Documents/ЗаявкаНаРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРесурсы</Name>
			<BasedOn>
				<xr:Item>Catalog.Задачи</xr:Item>
				<xr:Item>Catalog.Договоры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаявкиНаРесурсы</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиНаРесурсыДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявкиНаРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Персонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Деньги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовал</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаРесурсы/Ext/ManagerModule.bsl
Процедура ЗаполнитьПоОснованиюЗадачи(Объект, ДанныеЗаполнения) Экспорт
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Задачи.Ссылка КАК Задача,
	//	|	Задачи.Владелец КАК Договор,
	//	|	Задачи.Администратор КАК АдминистраторЗадачи,
	//	|	ВЫРАЗИТЬ(Задачи.Владелец КАК Справочник.Договоры).Администратор КАК АдминистраторДоговора
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	Справочник.Задачи КАК Задачи
	//	|ГДЕ
	//	|	Задачи.Ссылка = &ДанныеЗаполнения
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	МАКСИМУМ(ПроектыДоговоры.Ссылка) КАК Проект,
	//	|	ПроектыДоговоры.Договор КАК Договор
	//	|ПОМЕСТИТЬ ВТ_Проекты
	//	|ИЗ
	//	|	Справочник.Проекты.Договоры КАК ПроектыДоговоры
	//	|ГДЕ
	//	|	ПроектыДоговоры.Договор В
	//	|			(ВЫБРАТЬ
	//	|				вт.Договор
	//	|			ИЗ
	//	|				вт)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ПроектыДоговоры.Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ.Задача КАК Задача,
	//	|	ВТ.Договор КАК Договор,
	//	|	ВТ.АдминистраторЗадачи КАК АдминистраторЗадачи,
	//	|	ВТ.АдминистраторДоговора КАК АдминистраторДоговора,
	//	|	ЕСТЬNULL(ВТ_Проекты.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК Проект
	//	|ИЗ
	//	|	ВТ КАК ВТ
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Проекты КАК ВТ_Проекты
	//	|		ПО ВТ.Договор = ВТ_Проекты.Договор
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЗадачиРесурсы.Ссылка КАК Ссылка,
	//	|	ЗадачиРесурсы.НомерСтроки КАК НомерСтроки,
	//	|	ЗадачиРесурсы.Ресурс КАК Ресурс,
	//	|	ЗадачиРесурсы.Количество КАК Количество
	//	|ИЗ
	//	|	ВТ КАК ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Задачи.Ресурсы КАК ЗадачиРесурсы
	//	|		ПО ВТ.Задача = ЗадачиРесурсы.Ссылка";
	//
	//Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	//
	//Результат = Запрос.ВыполнитьПакет();
	//
	//ВыборкаШапка = Результат[Результат.Количество()-2].Выбрать();
	//ВыборкаШапка.Следующий();
	//
	//ЗаполнитьЗначенияСвойств(Объект, ВыборкаШапка);
	//
	//ВыборкаРесурсы = Результат[Результат.Количество()-1].Выбрать();
	//
	//Пока ВыборкаРесурсы.Следующий() Цикл
	//	СтрокаТаблицы = Объект.Ресурсы.Добавить();
	//	СтрокаТаблицы.Ресурс = ВыборкаРесурсы.Ресурс;
	//	СтрокаТаблицы.Количество = ВыборкаРесурсы.Количество;
	//КонецЦикла;
	//
КонецПроцедуры


Процедура ЗаполнитьПоОснованиюДоговора(Объект, ДанныеЗаполнения) Экспорт
	
	Объект.Договор					= ДанныеЗаполнения; 
	Объект.АдминистраторДоговора	= ДанныеЗаполнения.Администратор;
	ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Перемещение товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_ЗаявкаНаРесурсы";
	КомандаПечати.Представление = НСтр("ru = 'Заявка на ресурсы'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Печать накладной на перемещение.
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_ЗаявкаНаРесурсы");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_ЗаявкаНаРесурсы",
			НСтр("ru = 'Заявка на ресурсы'"),
			ПечатнаяФормаДоговора(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ЗаявкаНаРесурсы.ПФ_ЗаявкаНаРесурсы");
	КонецЕсли;
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область СлужебныеПроцедурыИФункции

Функция ПечатнаяФормаДоговора(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаявкаНаРесурсы.Ссылка КАК Ссылка,
	|	ЗаявкаНаРесурсы.Номер КАК Номер,
	|	ЗаявкаНаРесурсы.Дата КАК Дата,
	|	ЗаявкаНаРесурсы.Договор.Представление КАК Договор,
	|	ЗаявкаНаРесурсы.Задача КАК Задача,
	|	ЗаявкаНаРесурсы.Задача.Наименование КАК ЗадачаНаименование,
	|	ЗаявкаНаРесурсы.Задача.Администратор КАК ЗадачаАдминистратор,
	|	ЗаявкаНаРесурсы.Задача.ДатаНачала КАК ЗадачаДатаНачала,
	|	ЗаявкаНаРесурсы.Задача.ДатаОкончания КАК ЗадачаДатаОкончания,
	|	ЗаявкаНаРесурсы.Задача.СтатусЗадачи КАК ЗадачаСтатусЗадачи,
	|	ЗаявкаНаРесурсы.Проект.Наименование КАК ПроектНаименование,
	|	ЗаявкаНаРесурсы.Проект.ДатаНачала КАК ПроектДатаНачала,
	|	ЗаявкаНаРесурсы.Проект.ДатаОкончания КАК ПроектДатаОкончания,
	|	ЗаявкаНаРесурсы.Проект.Администратор КАК ПроектАдминистратор,
	|	ЗаявкаНаРесурсы.АдминистраторДоговора КАК АдминистраторДоговора,
	|	ЗаявкаНаРесурсы.Персонал.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Должность КАК Должность,
	|		КоличествоСтавок КАК КоличествоСтавок,
	|		КоличествоЧасов КАК КоличествоЧасов
	|	) КАК Персонал,
	|	ЗаявкаНаРесурсы.Деньги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Контрагент КАК Контрагент,
	|		Договор КАК Договор,
	|		Сумма КАК Сумма
	|	) КАК Деньги,
	|	ЗаявкаНаРесурсы.Материалы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Материал КАК Материал,
	|		Количество КАК Количество
	|	) КАК Материалы,
	|	ЗаявкаНаРесурсы.Инструменты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Инструмент КАК Инструмент,
	|		КоличествоЧасов КАК КоличествоЧасов
	|	) КАК Инструменты,
	|	ЗаявкаНаРесурсы.Согласующие.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник
	|	) КАК Согласующие
	|ИЗ
	|	Документ.ЗаявкаНаРесурсы КАК ЗаявкаНаРесурсы
	|ГДЕ
	|	ЗаявкаНаРесурсы.Ссылка В(&Ссылка)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	Пакет = Запрос.Выполнить();
	
	Шапка = Пакет.Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_ЗаявкаНаРесурсы";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаРесурсы.ПФ_ЗаявкаНаРесурсы");
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьЗаголовок.Параметры.НомерДокумента = Шапка.Номер;
		ОбластьЗаголовок.Параметры.ДатаДокумента = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, Шапка);
		ОбластьШапка.Параметры.ЗадачаДатаНачала = Формат(ОбластьШапка.Параметры.ЗадачаДатаНачала, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ЗадачаДатаОкончания = Формат(ОбластьШапка.Параметры.ЗадачаДатаОкончания, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ПроектДатаНачала = Формат(ОбластьШапка.Параметры.ПроектДатаНачала, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ПроектДатаОкончания = Формат(ОбластьШапка.Параметры.ПроектДатаОкончания, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		//ТЗРесурсы = Шапка.Ресурсы.Выгрузить();
		//Для Каждого Строка из ТЗРесурсы Цикл
		//	ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
		//	ТабличныйДокумент.Вывести(ОбластьСтрока);
		//КонецЦикла;
		
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы3");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы3");
		Строка = Шапка.Персонал.Выбрать();
		Пока Строка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы2");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы2");
		Строка = Шапка.Деньги.Выбрать();
		Пока Строка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы1");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы1");
		Строка = Шапка.Инструменты.Выбрать();
		Пока Строка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Строка = Шапка.Материалы.Выбрать();
		Пока Строка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции

#КонецОбласти
#КонецЕсли
